In [1]:
import pandas as pd

In [2]:
datafile_path = "college_data.csv"
datafile_df =pd.read_csv(datafile_path)
# datafile_df.head()

In [3]:
school_df = datafile_df.loc[:,["Year","College_names","College_state","In_state_tuition","Out_of_state_tuition","Admissions_rate_overall","Enrollment","Student Size"]]


school_df_sorted = school_df.sort_values(["College_names","Year"],ascending = (True))
school_df.head()

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student Size
0,2002,"""Washington State University""","""WA""",4520,12270,0.7708,5100,4406
1,2003,"""Washington State University""","""WA""",5280,13382,0.7798,6037,4590
2,2004,"""Washington State University""","""WA""",5628,14046,0.7529,5368,4728
3,2005,"""Washington State University""","""WA""",5980,14985,0.7389,22177,19078
4,2006,"""Washington State University""","""WA""",6448,16088,0.7706,22444,18995

In [4]:
# school_df.dtypes

In [5]:
# Converting the "Cocoa Percent" column to floats
school_df["Year"] = school_df["Year"].astype('object')
school_df.dtypes

Year                        object
College_names               object
College_state               object
In_state_tuition             int64
Out_of_state_tuition         int64
Admissions_rate_overall    float64
Enrollment                   int64
Student Size                 int64
dtype: object

In [6]:
# school_df["College_names"] = school_df["College_names"].replace(
#     '"', '', regex=True)

school_df[["College_names","College_state"]] = school_df[["College_names","College_state"]].replace(
    '"', '', regex=True)
school_df.head()

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student Size
0,2002,Washington State University,WA,4520,12270,0.7708,5100,4406
1,2003,Washington State University,WA,5280,13382,0.7798,6037,4590
2,2004,Washington State University,WA,5628,14046,0.7529,5368,4728
3,2005,Washington State University,WA,5980,14985,0.7389,22177,19078
4,2006,Washington State University,WA,6448,16088,0.7706,22444,18995

In [7]:
# print(school_df["College_names"].unique())
school_df.head()

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student Size
0,2002,Washington State University,WA,4520,12270,0.7708,5100,4406
1,2003,Washington State University,WA,5280,13382,0.7798,6037,4590
2,2004,Washington State University,WA,5628,14046,0.7529,5368,4728
3,2005,Washington State University,WA,5980,14985,0.7389,22177,19078
4,2006,Washington State University,WA,6448,16088,0.7706,22444,18995

In [8]:
# Individual School DataFrames

# wsu_df = school_df.loc[school_df["College_names"]=="Washington State University",:]
# uoa_df = school_df.loc[school_df["College_names"]=="University of Arizona",:]
# asu_df = school_df.loc[school_df["College_names"]=="Arizona State University-Tempe",:]
# uc_berkeley_df = school_df.loc[school_df["College_names"]=="University of California-Berkeley",:]
# ucla_df = school_df.loc[school_df["College_names"]=="University of California-Los Angeles",:]
# ucb_df = school_df.loc[school_df["College_names"]=="University of Colorado Boulder",:]
# uoo_df = school_df.loc[school_df["College_names"]=="University of Oregon",:]
# osu_df = school_df.loc[school_df["College_names"]=="Oregon State University",:]
# usc_df = school_df.loc[school_df["College_names"]=="University of Southern California",:]
# stanford_df = school_df.loc[school_df["College_names"]=="Stanford University",:]
# uou_df = school_df.loc[school_df["College_names"]=="University of Utah",:]
# uow_df = school_df.loc[school_df["College_names"]=="University of Washington-Seattle Campus",:]

In [9]:
school_df["Difference in tuition"]=school_df["Out_of_state_tuition"]-school_df["In_state_tuition"]

school_df["Percent Difference Change"]=school_df["Difference in tuition"]/school_df["Out_of_state_tuition"]


school_df=school_df[['Year','College_names','College_state','In_state_tuition',\
                     'Out_of_state_tuition','Difference in tuition','Percent Difference Change'\
                    ,'Enrollment','Student Size','Admissions_rate_overall']]

clean_school_df = school_df.rename(columns={'Year':'Year',\
                                            'College_names':'College_Names',\
                                            'College_state':'State',\
                                            'In_state_tuition':'In_State_Tuition',\
                                            'Out_of_state_tuition':'Out_of_State_Tuition',\
                                            'Difference in tuition':'Tuition_Difference',\
                                            'Percent Difference Change': '%_Difference',\
                                            'Student Size':'Student_Size',\
                                            'Admissions_rate_overall':"Admission_%"})
clean_school_df.head()

,Year,College_Names,State,In_State_Tuition,Out_of_State_Tuition,Tuition_Difference,%_Difference,Enrollment,Student_Size,Admission_%
0,2002,Washington State University,WA,4520,12270,7750,0.631622,5100,4406,0.7708
1,2003,Washington State University,WA,5280,13382,8102,0.605440,6037,4590,0.7798
2,2004,Washington State University,WA,5628,14046,8418,0.599317,5368,4728,0.7529
3,2005,Washington State University,WA,5980,14985,9005,0.600934,22177,19078,0.7389
4,2006,Washington State University,WA,6448,16088,9640,0.599204,22444,18995,0.7706

In [11]:
avg_in_state = clean_school_df.groupby(['College_Names']).mean()['In_State_Tuition'].rename("Avg_In_State_Tuition") 
# avg_in_state.head(25)
avg_in_state_year = clean_school_df.groupby(['Year']).mean()['In_State_Tuition'].rename("Avg_In_State_Tuition_by_Year")
# avg_in_state_year.head(25)
avg_out_of_state = clean_school_df.groupby(['College_Names']).mean()['Out_of_State_Tuition'].rename("Avg_Out_of_State_Tuition") 
# avg_out_of_state.head(25)
avg_out_of_state_year = clean_school_df.groupby(['Year']).mean()['Out_of_State_Tuition'].rename("Avg_Out_of_State_Tuition_by_Year")
# avg_in_state_year.head(25)

tuition_avgs_by_school = pd.DataFrame({"Avg_In_State_Tuition":avg_in_state,
                                        "Avg_Out_of_State_Tuition": avg_out_of_state,})



tuition_avgs_by_school['Avg_In_State_Tuition'] = tuition_avgs_by_school['Avg_In_State_Tuition'].map('${:,.2f}'.format)
tuition_avgs_by_school['Avg_Out_of_State_Tuition'] = tuition_avgs_by_school['Avg_Out_of_State_Tuition'].map('${:,.2f}'.format)
tuition_avgs_by_school

,Avg_In_State_Tuition,Avg_Out_of_State_Tuition
College_Names,,
Arizona State University-Tempe,"$7,444.12","$20,196.88"
Oregon State University,"$7,461.47","$21,941.41"
Stanford University,"$39,320.06","$39,320.06"
University of Arizona,"$7,892.59","$23,225.65"
University of California-Berkeley,"$10,091.29","$31,586.00"
University of California-Los Angeles,"$9,824.41","$31,298.94"
University of Colorado Boulder,"$8,253.47","$28,587.65"
University of Oregon,"$8,057.24","$25,035.47"
University of Southern California,"$41,215.88","$41,215.88"
University of Utah,"$6,247.88","$19,687.65"
University of Washington-Seattle Campus,"$8,740.35","$26,479.53"
Washington State University,"$9,064.76","$20,464.82"

In [12]:
tuition_avgs_by_year = pd.DataFrame({"Avg In State Tuition by Year": avg_in_state_year,
"Avg Out of State Tuition by Year":avg_out_of_state_year})

tuition_avgs_by_year["Avg In State Tuition by Year"] = tuition_avgs_by_year["Avg In State Tuition by Year"].map('${:,.2f}'.format)
tuition_avgs_by_year["Avg Out of State Tuition by Year"] = tuition_avgs_by_year["Avg Out of State Tuition by Year"].map('${:,.2f}'.format)
tuition_avgs_by_year

     Avg In State Tuition by Year Avg Out of State Tuition by Year
Year
2002                    $7,671.17                       $16,340.50
2003                    $8,652.33                       $18,078.83
2004                    $9,325.08                       $19,499.17
2005                    $9,786.92                       $20,525.58
2006                   $10,309.58                       $21,603.67
2007                   $11,017.25                       $22,910.17
2008                   $11,704.25                       $24,245.17
2009                   $12,790.25                       $26,393.33
2010                   $13,963.50                       $27,943.67
2011                   $15,277.75                       $29,524.42
2012                   $15,897.08                       $30,628.33
2013                   $16,367.25                       $31,572.33
2014                   $16,896.00                       $32,770.42
2015                   $17,320.17                       $34,245.25
2016                   $17,646.75                       $35,526.83
2017                   $18,336.58                       $36,648.67
2018                   $18,823.92                       $37,683.58